{
    "movies": [
        {
            "title": "The Phoenician Scheme",
            "genre": "Action/Adventure",
            "image": "./images/phoenician_scheme.jpg",
            "description": "Wealthy businessman Zsa-zsa Korda appoints his only daughter Liesl, a nun, as sole heir to his estate. As Korda embarks on a new enterprise, they soon become the target of scheming tycoons, foreign terrorists and determined assassins. Directed by Wes Anderson, The Phoenician Scheme is a star-studded, is entertaining, humorous and visually striking with a surprisingly big heart.",
            "rating": 4.5,
            "releaseYear": 2025,
            "trailerUrl": "https://www.youtube.com/watch?v=GEuMnPl2WI4",
            "showtimes": [
                "Tuesday, June 24, 2025, 2:20 PM & 7:15 PM",
                "Wednesday, June 25, 2025, 2:20 PM & 7:15 PM",
                "Thursday, June 24, 2025, 2:20 PM & 7:15 PM"
            ]
        },
        {
            "title": "Materialists",
            "genre": "Comedy",
            "image": "./images/materialists.jpg",
            "description": "Lucy, a young, ambitious New York City matchmaker, finds herself torn between Harry, the perfect match, and her imperfect ex John, who's still in love with her. Thoughtful and insightful, Materialists delivers a refreshing take on dating in the modern world. ",
            "rating": 4.0,
            "releaseYear": 2025,
            "trailerUrl": "https://www.youtube.com/watch?v=4A_kmjtsJ7c",
            "showtimes": [
                "Tuesday, June 24, 2025, 1:45 PM & 7:00 PM",
                "Wednesday, June 25, 2025, 1:45 PM & 7:00 PM",
                "Thursday, June 24, 2025, 1:45 PM & 7:00 PM"
            ]      
        },
        {
            "title": "How to train your dragon",
            "genre": "Fantasy",
            "image": "./images/dragon.jpg",
            "description": "On the rugged isle of Berk, where Vikings and dragons have been bitter enemies for generations, Hiccup stands apart. Hiccup defies centuries of tradition when he befriends Toothless, a feared Night Fury dragon. Their unlikely bond reveals the true nature of dragons, challenging the very foundations of Viking society. This live-action reimagining of the animated classic How to Train Your Dragon is spectacular. A visually stunning, perfectly casted and emotionally engaging film that creates a thrilling movie theatre experience for the whole family.",
            "rating": 4.8,
            "releaseYear": 2025,
            "trailerUrl": "https://www.youtube.com/watch?v=22w7z_lT6YM",
            "showtimes": [
                "Tuesday, June 24, 2025, 2:00 PM & 6:45 PM",
                "Wednesday, June 25, 2025, 2:00 PM & 6:45 PM",
                "Thursday, June 24, 2025, 2:00 PM & 6:45 PM"
            ]
        }
    ]
}