{
    "movies": [
        {
            "title": "SUPERMAN",
            "genre": "Action/Adventure",
            "image": "./images/superman.jpg",
            "description": "Superman embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent. He faces challenges from Lex Luthor's war profiteering and a government-created clone named 'Ultraman'. Superman teams up with other heroes like Hawkgirl and Green Lantern to stop Ultraman, while Lois Lane and the Daily Planet staff work to expose Luthor's crimes. Starring David Corenswet, Rachel Brosnahan, and Nicholas Hoult, Superman is a triumph, summer movie entertainment at its best! Rated PG (violence, coarse lang) 2 hours 10 minutes.",
            "rating": 4.5,
            "releaseYear": 2025,
            "trailerUrl": "https://www.youtube.com/watch?v=Ox8ZLF6cGM0",
            "showtimes": [
                "TUES, JUL 22 @ 2:10 & 7:30",
                "WED, JUL 23 @ 2:10 & 7:30",
                "THU, JUL 24 @ 2:10 & 7:30"
            ]
        },
        {
            "title": "F1: The Movie",
            "genre": "Action",
            "image": "./images/F1movie.jpg",
            "description": "**Plays for 2 weeks** Dubbed 'the greatest that never was,' Sonny Hayes was FORMULA 1's most promising phenom of the 1990s until an accident nearly ended his career. Thirty years later, he's approached by his former teammate Ruben Cervantes, to come back to FORMULA 1 for one last shot at saving the team and being the best in the world. He'll drive alongside Joshua Pearce, the team's hotshot rookie intent on setting his own pace. Truly one of the most entertaining movies of the year that will keep you on edge cheering & possibly have your jaw on the floor with the astonishing racing scenes and locations, and a great cast that includes Brad Pitt, Javier Bardem, and Damson Idris. Fl: The Movie is the very definition of a crowd-pleaser.",
            "releaseYear": 2025,
            "trailerUrl": "https://www.youtube.com/watch?v=8yh9BPUBbbQ",
            "showtimes": [
                "TUES, JUL 22 @ 1:45",
                "WED, JUL 23 @ 6:45",
                "THU, JUL 24 @ 6:45"
            ]
        },
              {
            "title": "Smurfs",
            "genre": "Animation-Fantasy",
            "image": "./images/smurfs.jpg",
            "releaseYear": 2025,
            "description": "In this animated adventure, the Smurfs embark on a journey through the Forbidden Forest to find a mysterious lost village. Along the way, they encounter new friends and face off against the evil wizard Gargamel. With stunning visuals and a heartwarming story, Smurfs: The Lost Village is a delightful film for the whole family.",
            "trailerUrl": "https://www.youtube.com/watch?v=s18jQqtGsMw",
            "showtimes": [
                "TUES, JUL 22 @ 2:30 & 7:10",
                "WED, JUL 23 @ 2:30 & 7:10",
                "THU, JUL 24 @ 2:30 & 7:10"
            ]
        },
                {
            "title": "The Life of Chuck",
            "genre": "Fantasy-Drama",
            "image": "./images/life_chuck.jpg",
            "releaseYear": 2025,
            "description": "Written and directed by Mike Flanagan, based on the novella of the same name by Stephen King, published in his 2020 compilation If It Bleeds. The film stars Tom Hiddleston, Chiwetel Ejiofor, Karen Gillan, Mia Sara, Carl Lumbly, Benjamin Pajak, Jacob Tremblay, and Mark Hamill, with narration by Nick Offerman. Its plot follows the formative moments in the life of Charles 'Chuck' Krantz, chronicled in reverse chronological order, from his death coinciding with the end of the universe to his childhood.",
            "trailerUrl": "https://www.youtube.com/watch?v=dOyXdwXt8d4",
            "showtimes": [
                "TUES, JUL 22 @ 6:45",
                "WED, JUL 23 @ 1:45",
                "THU, JUL 24 @ 1:45"
            ]
        }
    ]
}